In [1]:
import numpy as np
import pandas as pd

In [26]:
data = pd.read_csv("/home/developer/Downloads/archive/Student_performance_data _.csv")

In [24]:
data.head()

,StudentID,Gender,Ethnicity,ParentalEducation,StudyTimeWeekly,Absences,Tutoring,ParentalSupport,Extracurricular,Sports,Music,Volunteering,GPA,GradeClass
Age,,,,,,,,,,,,,,
17,1001,1,0,2,19.833723,7,1,2,0,0,1,0,2.929196,2.0
18,1002,0,0,1,15.408756,0,0,1,0,0,0,0,3.042915,1.0
15,1003,0,2,3,4.210570,26,0,2,0,0,0,0,0.112602,4.0
17,1004,1,0,3,10.028829,14,0,3,1,0,0,0,2.054218,3.0
17,1005,1,0,2,4.672495,17,1,3,0,0,0,0,1.288061,4.0

In [4]:
data.shape()
data.info()
data.dscribe()

TypeError: 'tuple' object is not callable

In [5]:
data.shape()

TypeError: 'tuple' object is not callable

In [6]:
type(data)

pandas.core.frame.DataFrame

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2392 entries, 0 to 2391
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   StudentID          2392 non-null   int64
 1   Age                2392 non-null   int64
 2   Gender             2392 non-null   int64
 3   Ethnicity          2392 non-null   int64
 4   ParentalEducation  2392 non-null   int64
 5   StudyTimeWeekly    2392 non-null   float64
 6   Absences           2392 non-null   int64
 7   Tutoring           2392 non-null   int64
 8   ParentalSupport    2392 non-null   int64
 9   Extracurricular    2392 non-null   int64
 10  Sports             2392 non-null   int64
 11  Music              2392 non-null   int64
 12  Volunteering       2392 non-null   int64
 13  GPA                2392 non-null   float64
 14  GradeClass         2392 non-null   float64
dtypes: float64(3), int64(12)
memory usage: 280.4 KB

In [11]:
data["Gender","Music","ParentalSupport"]

KeyError: ('Gender', 'Music', 'ParentalSupport')

In [9]:
data.shape

(2392, 15)

In [12]:
data.columns

Index(['StudentID', 'Age', 'Gender', 'Ethnicity', 'ParentalEducation',
       'StudyTimeWeekly', 'Absences', 'Tutoring', 'ParentalSupport',
       'Extracurricular', 'Sports', 'Music', 'Volunteering', 'GPA',
       'GradeClass'],
      dtype='object')

In [18]:
data[['Gender','Music','ParentalSupport']]

      Gender  Music  ParentalSupport
0          1      1                2
1          0      0                1
2          0      0                2
3          1      0                3
4          1      0                3
...      ...    ...              ...
2387       1      0                4
2388       0      0                4
2389       1      0                2
2390       1      1                2
2391       1      0                2

[2392 rows x 3 columns]

In [19]:
data.describe()

,StudentID,Age,Gender,Ethnicity,ParentalEducation,StudyTimeWeekly,Absences,Tutoring,ParentalSupport,Extracurricular,Sports,Music,Volunteering,GPA,GradeClass
count,2392.000000,2392.000000,2392.000000,2392.000000,2392.000000,2392.000000,2392.000000,2392.000000,2392.000000,2392.000000,2392.000000,2392.000000,2392.000000,2392.000000,2392.000000
mean,2196.500000,16.468645,0.510870,0.877508,1.746237,9.771992,14.541388,0.301421,2.122074,0.383361,0.303512,0.196906,0.157191,1.906186,2.983696
std,690.655244,1.123798,0.499986,1.028476,1.000411,5.652774,8.467417,0.458971,1.122813,0.486307,0.459870,0.397744,0.364057,0.915156,1.233908
min,1001.000000,15.000000,0.000000,0.000000,0.000000,0.001057,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,1598.750000,15.000000,0.000000,0.000000,1.000000,5.043079,7.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,1.174803,2.000000
50%,2196.500000,16.000000,1.000000,0.000000,2.000000,9.705363,15.000000,0.000000,2.000000,0.000000,0.000000,0.000000,0.000000,1.893393,4.000000
75%,2794.250000,17.000000,1.000000,2.000000,2.000000,14.408410,22.000000,1.000000,3.000000,1.000000,1.000000,0.000000,0.000000,2.622216,4.000000
max,3392.000000,18.000000,1.000000,3.000000,4.000000,19.978094,29.000000,1.000000,4.000000,1.000000,1.000000,1.000000,1.000000,4.000000,4.000000

In [20]:
data[data.index == 1]

,StudentID,Age,Gender,Ethnicity,ParentalEducation,StudyTimeWeekly,Absences,Tutoring,ParentalSupport,Extracurricular,Sports,Music,Volunteering,GPA,GradeClass
1,1002,18,0,0,1,15.408756,0,0,1,0,0,0,0,3.042915,1.0

In [21]:
data[data.index == 2]

,StudentID,Age,Gender,Ethnicity,ParentalEducation,StudyTimeWeekly,Absences,Tutoring,ParentalSupport,Extracurricular,Sports,Music,Volunteering,GPA,GradeClass
2,1003,15,0,2,3,4.21057,26,0,2,0,0,0,0,0.112602,4.0

In [25]:
data[data.index==17]

,StudentID,Gender,Ethnicity,ParentalEducation,StudyTimeWeekly,Absences,Tutoring,ParentalSupport,Extracurricular,Sports,Music,Volunteering,GPA,GradeClass
Age,,,,,,,,,,,,,,
17,1001,1,0,2,19.833723,7,1,2,0,0,1,0,2.929196,2.0
17,1004,1,0,3,10.028829,14,0,3,1,0,0,0,2.054218,3.0
17,1005,1,0,2,4.672495,17,1,3,0,0,0,0,1.288061,4.0
17,1009,0,0,0,4.562008,1,0,2,0,1,0,1,2.896819,2.0
17,1011,0,0,1,11.851364,11,0,1,0,0,0,0,2.147172,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17,3358,0,2,1,16.894183,10,0,3,0,0,0,1,2.471396,4.0
17,3363,1,2,2,0.675783,19,1,0,0,0,0,0,1.041029,2.0
17,3366,1,2,2,6.918990,3,0,2,0,0,0,0,2.742092,2.0
17,3377,1,2,2,14.667230,3,0,0,1,0,0,0,2.928219,1.0
17,3389,0,0,1,7.583217,4,1,4,0,1,0,0,3.279150,4.0

In [28]:
data[data.index == 0]

,StudentID,Age,Gender,Ethnicity,ParentalEducation,StudyTimeWeekly,Absences,Tutoring,ParentalSupport,Extracurricular,Sports,Music,Volunteering,GPA,GradeClass
0,1001,17,1,0,2,19.833723,7,1,2,0,0,1,0,2.929196,2.0

In [29]:
data.loc[0]

StudentID            1001.000000
Age                    17.000000
Gender                  1.000000
Ethnicity               0.000000
ParentalEducation       2.000000
StudyTimeWeekly        19.833723
Absences                7.000000
Tutoring                1.000000
ParentalSupport         2.000000
Extracurricular         0.000000
Sports                  0.000000
Music                   1.000000
Volunteering            0.000000
GPA                     2.929196
GradeClass              2.000000
Name: 0, dtype: float64

In [30]:
data.iloc[0]

StudentID            1001.000000
Age                    17.000000
Gender                  1.000000
Ethnicity               0.000000
ParentalEducation       2.000000
StudyTimeWeekly        19.833723
Absences                7.000000
Tutoring                1.000000
ParentalSupport         2.000000
Extracurricular         0.000000
Sports                  0.000000
Music                   1.000000
Volunteering            0.000000
GPA                     2.929196
GradeClass              2.000000
Name: 0, dtype: float64

In [36]:
data.loc[0:4:2, 'Age']

0    17
2    15
4    17
Name: Age, dtype: int64

In [37]:
import pandas as pd
import numpy as np

In [40]:
data ={
    'name' : ['alice', 'bob', 'charlie'],
    'age' : [25, 30 ,35],
    'city' : ['new york', 'los angeles', 'chicago']
}
df = pd.DataFrame(data)
df.head()

      name  age         city
0    alice   25     new york
1      bob   30  los angeles
2  charlie   35      chicago

In [41]:
df['name']

0      alice
1        bob
2    charlie
Name: name, dtype: object

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   city    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [43]:
df.describe()

        age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [44]:
df.loc[0]  # row by index

name       alice
age           25
city    new york
Name: 0, dtype: object

In [45]:
df.iloc[0] # first row

name       alice
age           25
city    new york
Name: 0, dtype: object

In [47]:
df.iloc[:, 1]

0    25
1    30
2    35
Name: age, dtype: int64

In [48]:
df.loc[: , 'name']

0      alice
1        bob
2    charlie
Name: name, dtype: object

In [49]:
df['salary'] = [70000, 80000,90000]

In [50]:
df

      name  age         city  salary
0    alice   25     new york   70000
1      bob   30  los angeles   80000
2  charlie   35      chicago   90000

In [51]:
df.drop('salary' ,axis=1 , inplace=True)

In [52]:
df

      name  age         city
0    alice   25     new york
1      bob   30  los angeles
2  charlie   35      chicago

In [56]:
df.rename(columns={'name' :'full name','age' : 'years'}, inplace=True)

In [57]:
df

  full name  years         city
0     alice     25     new york
1       bob     30  los angeles
2   charlie     35      chicago

In [59]:
df.rename(columns={'city' :'country'}, inplace=False)

  full name  years      country
0     alice     25     new york
1       bob     30  los angeles
2   charlie     35      chicago

In [60]:
df

  full name  years         city
0     alice     25     new york
1       bob     30  los angeles
2   charlie     35      chicago

In [63]:
df['salary']=[1,2,None]
df

  full name  years         city  salary
0     alice     25     new york     1.0
1       bob     30  los angeles     2.0
2   charlie     35      chicago     NaN

In [72]:
df.fillna(3, inplace=True)
df

  full name  years         city  salary
0     alice     25     new york     1.0
1       bob     30  los angeles     2.0
2   charlie     35      chicago     0.0

In [75]:
df.loc[2,'salary'] = 5

In [76]:
df

  full name  years         city  salary  (2, salary)
0     alice     25     new york     1.0            5
1       bob     30  los angeles     2.0            5
2   charlie     35      chicago     5.0            5

In [77]:
df['salary'] = df['salary'].astype(int)
df.dtypes

full name      object
years           int64
city           object
salary          int64
(2, salary)     int64
dtype: object

In [78]:
df

  full name  years         city  salary  (2, salary)
0     alice     25     new york       1            5
1       bob     30  los angeles       2            5
2   charlie     35      chicago       5            5

In [94]:
df.drop((2, 'salary'),axis=1,inplace=True)
df

  full name  years         city  salary
0     alice     25     new york       1
1       bob     30  los angeles       2
2   charlie     35      chicago       5

In [92]:
df.columns

Index(['full name', 'years', 'city', 'salary', (2, 'salary')], dtype='object')

In [96]:
filtered_df = df[df['years'] >=30]
filtered_df

  full name  years         city  salary
1       bob     30  los angeles       2
2   charlie     35      chicago       5

In [99]:
sorted_df = df.sort_values(by='years', ascending= False)
sorted_df

  full name  years         city  salary
2   charlie     35      chicago       5
1       bob     30  los angeles       2
0     alice     25     new york       1

In [104]:
grouped = df.groupby('salary')
grouped.groups

{1: [0], 2: [1], 5: [2]}

In [105]:
for n , v in df.groupby('salary'):
    print(n,v)

1   full name  years      city  salary
0     alice     25  new york       1
2   full name  years         city  salary
1       bob     30  los angeles       2
5   full name  years     city  salary
2   charlie     35  chicago       5

In [107]:
aggregated = df.groupby('city').agg({'years': 'mean','salary' :'sum'})
aggregated

             years  salary
city
chicago       35.0       5
los angeles   30.0       2
new york      25.0       1